tutorials/eccentricRotation/Allrun
#!/bin/bash
cd "${0%/*}" || exit 1
. $WM_PROJECT_DIR/bin/tools/RunFunctions
runApplication blockMesh
runApplication ibmSetGeometry
runApplication $(getApplication)
